In [1]:
import pandas as pd

In [2]:
friends = [
        ['name', ['beom', 'seek', 'wan']],
        ['age', [28,27,28]],
        ['job', ['student', 'programmer','master']]
]

In [3]:
df = pd.DataFrame.from_items(friends)
df.head()

   name  age         job
0  beom   28     student
1  seek   27  programmer
2   wan   28      master

In [4]:
df.to_csv('friends.csv') # default설정 : index=True, header = True
# df.to_csv('friends.csv', index=True, header = True)

![Pandas_ch2_1](images/Pandas_ch2_1.png)

None value가 있을 경우

In [5]:
friends = [
        ['name', ['beom', 'seek', 'wan']],
        ['age', [28,27,28]],
        ['job', ['student', None,'master']]
]

In [6]:
df = pd.DataFrame.from_items(friends)
df.head()

   name  age      job
0  beom   28  student
1  seek   27     None
2   wan   28   master

In [7]:
df.to_csv('friends.csv', na_rep = 'default')

![Pandas_ch2_2](images/Pandas_ch2_2.png)